"""
    1) 리스트 : 다른 언어의 배열 ( 어떤 자료형을 사용해도 상관없음 )
        기호 : []
        선언 방법
            (1) 변수명 = []        # 10,'a',0.5 순서로 적어도 됨
            (2) 변수명 = list()
        읽기, 쓰기, 수정, 삽입(추가) 가능
        값의 순서가 있음

    2) 튜플
        기호 : ()
        선언 방법
            (1) 변수명 = ()
            (2) 변수명 = tuple()
        읽기 전용
        값의 순서가 있음

    * 리스트 <-> 튜플 서로 형태 바꿀 수 있음

    3) 세트 : 수학에서의 집합
        기호 : {}
        선언 방법
            (1) 변수명 = {값, 값}
            (2) 변수명 = set()         # 변수 = {}처럼 값이 없으면 딕셔너리로 인식
        중복값 허용 x
        교집합, 합집합, 차집합, 교차집합
        정해진 순서 x. 번호 체계도 없음

    4) 딕셔너리 : 사전, 키와 값의 쌍으로 존재
        ex) 사과(키) : apple(값)
        기호 : {}
        선언 방법
            (1) 변수명 = {}
            (2) 변수명 = dict()
        정해진 순서 x. 번호 체계도 없음
"""